In [16]:
import pandas as pd
import numpy as np

In [17]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'year': [2012, 2012, 2013, 2014, 2014],
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

In [18]:
df[df['coverage'] > 50]

            coverage   name  reports  year
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

In [19]:
df_filtered = df[(df['coverage'] > 50) & (df['coverage'] < 70)]
df_filtered

            coverage  name  reports  year
Santa Cruz        57  Tina       31  2013
Maricopa          62  Jake        2  2014

In [20]:
df1 = pd.DataFrame( { 
    "Name" : ["Alice", "Bob", "Mallory", "Mallory", "Bob" , "Mallory"] , 
    "City" : ["Seattle", "Seattle", "Portland", "Seattle", "Seattle", "Portland"] } )
df1

       City     Name
0   Seattle    Alice
1   Seattle      Bob
2  Portland  Mallory
3   Seattle  Mallory
4   Seattle      Bob
5  Portland  Mallory

In [21]:
g1 = df1.groupby( [ "Name", "City"] )
g1

In [22]:
for fo, group in df1.groupby('Name')['City']:
    print fo
    print group

Alice
0    Seattle
Name: City, dtype: object
Bob
1    Seattle
4    Seattle
Name: City, dtype: object
Mallory
2    Portland
3     Seattle
5    Portland
Name: City, dtype: object

In [23]:
df2 = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'run'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})
df2

     A      B         C         D
0  foo    one -1.811160 -0.406295
1  bar    one  0.385114  0.437394
2  foo    two  0.037448  1.286464
3  bar  three  0.291526 -1.051035
4  foo    two  2.485846 -0.143333
5  bar    two -0.682696 -1.297187
6  foo    one -1.035729 -0.624097
7  run  three -0.659827 -0.272333

In [24]:
df2.A[0]

'foo'

In [25]:
df2.dtypes

A     object
B     object
C    float64
D    float64
dtype: object

In [26]:
def typer(x):
#     if x=='foo':
    if x=="foo":        
        return 'BIG'
#     elif x=='bar':
    elif x=="bar":        
        return 'SMALL'
    else:        
        return 'UNKNOWN'

In [27]:
df2

     A      B         C         D
0  foo    one -1.811160 -0.406295
1  bar    one  0.385114  0.437394
2  foo    two  0.037448  1.286464
3  bar  three  0.291526 -1.051035
4  foo    two  2.485846 -0.143333
5  bar    two -0.682696 -1.297187
6  foo    one -1.035729 -0.624097
7  run  three -0.659827 -0.272333

In [37]:
df3=df2.copy(deep=True)
df3.A=df3.A.apply(typer)

In [38]:
df3

         A      B         C         D
0      BIG    one -1.811160 -0.406295
1    SMALL    one  0.385114  0.437394
2      BIG    two  0.037448  1.286464
3    SMALL  three  0.291526 -1.051035
4      BIG    two  2.485846 -0.143333
5    SMALL    two -0.682696 -1.297187
6      BIG    one -1.035729 -0.624097
7  UNKNOWN  three -0.659827 -0.272333

In [30]:
groupedA = df2.groupby('A')
groupedA.count()

     B  C  D
A
bar  3  3  3
foo  4  4  4
run  1  1  1